# 누락 데이터 처리

In [2]:
import pandas as pd
import seaborn as sns

In [2]:
# titanic 데이터 load

df = sns.load_dataset('titanic')
df.info()           # 데이터프레임의 데이터의 인덱스의 개수와 컬럼별 데이터의 개수 및 자료 타입

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

# 누락 데이터가 몇 개인지 확인 : value_counts(dropna = False)

In [3]:
# deck 컬럼에 누락 데이터가 존재하는 것을 확인
# deck 컬럼의 누락 데이터가 몇 개인지 확인 : value_counts(dropna = False)

df.deck.value_counts(dropna = False)           # value_counts()는 데이터프레임이 아닌 시리즈를 사용 
                                                  # Serise.value_counts(dropna = False)

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

## 누락 데이터를 직접 찾는 방법 : .isnull(), .notnull()

In [4]:
print(df.head().isnull())        # null 이면 True, 아니면 False
print()
print()

print(df.head().notnull())       # null 이면 False, 아니면 True
print()

   survived  pclass    sex    age  sibsp  parch   fare  embarked  class  \
0     False   False  False  False  False  False  False     False  False
1     False   False  False  False  False  False  False     False  False
2     False   False  False  False  False  False  False     False  False
3     False   False  False  False  False  False  False     False  False
4     False   False  False  False  False  False  False     False  False

     who  adult_male   deck  embark_town  alive  alone
0  False       False   True        False  False  False
1  False       False  False        False  False  False
2  False       False   True        False  False  False
3  False       False  False        False  False  False
4  False       False   True        False  False  False


   survived  pclass   sex   age  sibsp  parch  fare  embarked  class   who  \
0      True    True  True  True   True   True  True      True   True  True
1      True    True  True  True   True   True  True      True   True  True
2      True    True  True  True   True   True  True      True   True  True
3      True    True  True  True   True   True  True      True   True  True
4      True    True  True  True   True   True  True      True   True  True

   adult_male   deck  embark_town  alive  alone
0        True  False         True   True   True
1        True   True         True   True   True
2        True  False         True   True   True
3        True   True         True   True   True
4        True  False         True   True   True

# 누락 데이터의 개수 확인

In [5]:
print(df.head().isnull().sum(axis = 0))           # 컬럼별 누락 데이터의 개수 합
                                   # 그냥 무엇인가를 지워야 할 때, axis = 1 은 세로
                                   # sum, mean 등 계산을 할 때, axis = 0 이 세로

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           3
embark_town    0
alive          0
alone          0
dtype: int64

## isnull(), value_counts() -> 각 열의 값에 누락 변수가 몇 개씩 존재하는지 확인

In [6]:
miss_df = df.isnull()                 # isnull(), notnull() 은 데이터프레임을 가지고 확인
miss_df                               # value_counts() 는 시리즈를 가지고 확인

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
887,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,True,False,False,False,False,False,False,False,True,False,False,False
889,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False

In [7]:
for col in miss_df.columns:
    miss_count = miss_df[col].value_counts()         # 각 열의 NaN 개수
    
    try:
        print('{} : {}'.format(col, miss_count[True]))
    except:
        print('{} : {}'.format(col, 0))

survived : 0
pclass : 0
sex : 0
age : 177
sibsp : 0
parch : 0
fare : 0
embarked : 2
class : 0
who : 0
adult_male : 0
deck : 688
embark_town : 2
alive : 0
alone : 0

# 누락 데이터 처리 : dropna(axis = , how = , thresh = )

In [8]:
# NaN의 데이터가 500개 이상인 컬럼을 삭제 - deck 688이므로 삭제

df_thresh = df.dropna(axis = 1, thresh = 500)
df_thresh

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,Queenstown,no,True

In [9]:
df_thresh.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [13]:
# age 컬럼에 NaN이 있는 인덱스(행) 삭제

df_age = df_thresh.dropna(axis = 0, how = 'any')          # 'any' = nan이 있는 값만, 'all' = 전부
df_age.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 712 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     712 non-null    int64
 1   pclass       712 non-null    int64
 2   sex          712 non-null    object
 3   age          712 non-null    float64
 4   sibsp        712 non-null    int64
 5   parch        712 non-null    int64
 6   fare         712 non-null    float64
 7   embarked     712 non-null    object
 8   class        712 non-null    category
 9   who          712 non-null    object
 10  adult_male   712 non-null    bool
 11  embark_town  712 non-null    object
 12  alive        712 non-null    object
 13  alone        712 non-null    bool
dtypes: bool(2), category(1), float64(2), int64(4), object(5)
memory usage: 69.0+ KB

# 누락 데이터 치환    .fillna(값, inplace = True), .fillna(method = 'ffill' 또는 'bfill')

In [14]:
df['age'].head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

## age의 누락 데이터에 age의 평균값으로 치환

In [16]:
df_age = df.copy()

mean_age = df_age['age'].mean(axis = 0)        # age 값의 평균을 구함

df_age['age'].fillna(mean_age, inplace = True)       # df_age의 'age' 컬럼에 위에서 구한 평균을 넣음

df_age['age'].head(10)

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: age, dtype: float64

In [17]:
# age를 가장 많은 나이로 변경

df_age2 = df.copy()

age_max = df_age2['age'].max(axis = 0)

df_age2['age'].fillna(age_max, inplace = True)

df_age2['age'].head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    80.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

## 가장 빈번하게 나오는 값으로 대체 : idxmax()

In [21]:
# embark_town : 825행부터 829행까지 정보를 확인

df['embark_town'][825 : 830]                      # 시리즈는 [ : ]으로 확인한다.

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object

In [19]:
most_freq = df['embark_town'].value_counts()
most_freq

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [20]:
most_freq = df['embark_town'].value_counts().idxmax()   # 가장 빈번하게 나오는 자료를 찾음
most_freq

'Southampton'

In [22]:
df_embark = df.copy()

df_embark['embark_town'].fillna(most_freq, inplace =True)
df_embark['embark_town'][825 : 830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829    Southampton
Name: embark_town, dtype: object

# 중복 데이터 확인 : .duplicated()

In [23]:
df = pd.DataFrame({'c1' : ['a', 'a', 'b', 'a', 'b'],
                  'c2' : [1, 1, 1, 2, 2],
                  'c3' : [1, 1, 2, 2, 2]})

df                    # 0행과 1행이 중복

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [24]:
df.duplicated()
                      # 데이터프레임의 경우 앞에 나왔던 행 자료가 다시 나오면 True로 반환 (행 단위)

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [25]:
df['c2'].duplicated()                            # 시리즈의 경우 컬럼의 중복 확인

0    False
1     True
2     True
3    False
4     True
Name: c2, dtype: bool

# 중복 행 데이터를 제거 : .drop_duplicates()

In [26]:
df2 = df.drop_duplicates()                 # 반복되는 행을 삭제시킨다. (데이터프레임)
df2

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [28]:
# 컬럼을 기준으로 중복 행 제거 

df3 = df.drop_duplicates(subset = ['c2', 'c3']) 
df3                                     # subset으로 세부사항 조정

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2

In [3]:
# titanic 데이터를 load 해서 
# age 컬럼이 NaN이면 행을 삭제
# age 컬럼을 기준으로 중복을 제거한 데이터프레임을 추출

ti = sns.load_dataset('titanic')
ti.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [4]:
ti = ti.dropna(subset = ['age'], how = 'any', axis = 0)   # dropna 는 subset을 사용한다.
ti.info()                              # dropna를 사용하면 따로 저장

<class 'pandas.core.frame.DataFrame'>
Int64Index: 714 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     714 non-null    int64
 1   pclass       714 non-null    int64
 2   sex          714 non-null    object
 3   age          714 non-null    float64
 4   sibsp        714 non-null    int64
 5   parch        714 non-null    int64
 6   fare         714 non-null    float64
 7   embarked     712 non-null    object
 8   class        714 non-null    category
 9   who          714 non-null    object
 10  adult_male   714 non-null    bool
 11  deck         184 non-null    category
 12  embark_town  712 non-null    object
 13  alive        714 non-null    object
 14  alone        714 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 70.2+ KB

In [5]:
ti_age = ti.drop_duplicates(subset = ['age'])   # age 컬럼을 기준으로 나이가 같은 행을 제거
ti_age                         # drop_duplicates 를 사용해도 따로 저장

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.00,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.00,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.00,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.00,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.00,0,0,51.8625,S,First,man,True,E,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
755,1,2,male,0.67,1,1,14.5000,S,Second,child,False,NaN,Southampton,yes,False
767,0,3,female,30.50,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,no,True
803,1,3,male,0.42,0,1,8.5167,C,Third,child,False,NaN,Cherbourg,yes,False
843,0,3,male,34.50,0,0,6.4375,C,Third,man,True,NaN,Cherbourg,no,True
851,0,3,male,74.00,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True

# 모든 컬럼의 값이 같은 행을 제거

In [6]:
ti_dup = ti.drop_duplicates()                   
ti_dup

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [7]:
# 데이터 표준화

# dataset/auto-mpg.csv 파일을 load

df = pd.read_csv('../dataset/auto-mpg.csv', header = None)

# 컬럼명을 지정

df.columns = ['mpg', 'cylinders','displacement','horsepower',
             'weight', 'aceleration','model year','origin','name']
df.head()

,mpg,cylinders,displacement,horsepower,weight,aceleration,model year,origin,name
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino

In [8]:
# 단위 환산 -> 따로 컬럼을 추가해서 작업하는 것이 편하다.
# mpg 단위 : 갤런 /mile -> 리터 /km 

mpg_to_kpl = 1.60934 / 3.78541        # (0.425)

df['kpl'] = df['mpg'] * mpg_to_kpl

df.head(3)

,mpg,cylinders,displacement,horsepower,weight,aceleration,model year,origin,name,kpl
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu,7.652571
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320,6.377143
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite,7.652571

In [9]:
df['kpl'] = df['kpl'].round(2)
df.head(3)

,mpg,cylinders,displacement,horsepower,weight,aceleration,model year,origin,name,kpl
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu,7.65
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320,6.38
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite,7.65

In [11]:
# 데이터의 자료형을 변환

df.dtypes

mpg             float64
cylinders         int64
displacement    float64
horsepower       object
weight          float64
aceleration     float64
model year        int64
origin            int64
name             object
kpl             float64
dtype: object

In [13]:
df.horsepower.dtype   # = df['horsepower'].dtype

dtype('O')

In [14]:
df['horsepower'].astype(float)      # '?'가 있기 때문에 바꾸질 못함

ValueError: could not convert string to float: '?'

# horsepower의 자료를 검색, unique()

In [15]:
df['horsepower'].unique()

array(['130.0', '165.0', '150.0', '140.0', '198.0', '220.0', '215.0',
       '225.0', '190.0', '170.0', '160.0', '95.00', '97.00', '85.00',
       '88.00', '46.00', '87.00', '90.00', '113.0', '200.0', '210.0',
       '193.0', '?', '100.0', '105.0', '175.0', '153.0', '180.0', '110.0',
       '72.00', '86.00', '70.00', '76.00', '65.00', '69.00', '60.00',
       '80.00', '54.00', '208.0', '155.0', '112.0', '92.00', '145.0',
       '137.0', '158.0', '167.0', '94.00', '107.0', '230.0', '49.00',
       '75.00', '91.00', '122.0', '67.00', '83.00', '78.00', '52.00',
       '61.00', '93.00', '148.0', '129.0', '96.00', '71.00', '98.00',
       '115.0', '53.00', '81.00', '79.00', '120.0', '152.0', '102.0',
       '108.0', '68.00', '58.00', '149.0', '89.00', '63.00', '48.00',
       '66.00', '139.0', '103.0', '125.0', '133.0', '138.0', '135.0',
       '142.0', '77.00', '62.00', '132.0', '84.00', '64.00', '74.00',
       '116.0', '82.00'], dtype=object)

In [ ]:
# 1. 특수문자 (?, ! 등) -> NaN으로 치환
# 2. NaN 데이터의 행을 삭제
# 3. 데이터의 형을 변환

In [16]:
import numpy as np

In [17]:
df['horsepower'].replace('?', np.nan, inplace =True)
df['horsepower'].unique()

array(['130.0', '165.0', '150.0', '140.0', '198.0', '220.0', '215.0',
       '225.0', '190.0', '170.0', '160.0', '95.00', '97.00', '85.00',
       '88.00', '46.00', '87.00', '90.00', '113.0', '200.0', '210.0',
       '193.0', nan, '100.0', '105.0', '175.0', '153.0', '180.0', '110.0',
       '72.00', '86.00', '70.00', '76.00', '65.00', '69.00', '60.00',
       '80.00', '54.00', '208.0', '155.0', '112.0', '92.00', '145.0',
       '137.0', '158.0', '167.0', '94.00', '107.0', '230.0', '49.00',
       '75.00', '91.00', '122.0', '67.00', '83.00', '78.00', '52.00',
       '61.00', '93.00', '148.0', '129.0', '96.00', '71.00', '98.00',
       '115.0', '53.00', '81.00', '79.00', '120.0', '152.0', '102.0',
       '108.0', '68.00', '58.00', '149.0', '89.00', '63.00', '48.00',
       '66.00', '139.0', '103.0', '125.0', '133.0', '138.0', '135.0',
       '142.0', '77.00', '62.00', '132.0', '84.00', '64.00', '74.00',
       '116.0', '82.00'], dtype=object)

In [19]:
df.dropna(subset = ['horsepower'], axis = 0, inplace = True)
df['horsepower'].unique()                                     # 데이터프레임은 행을 잘라내는 수밖에?

array(['130.0', '165.0', '150.0', '140.0', '198.0', '220.0', '215.0',
       '225.0', '190.0', '170.0', '160.0', '95.00', '97.00', '85.00',
       '88.00', '46.00', '87.00', '90.00', '113.0', '200.0', '210.0',
       '193.0', '100.0', '105.0', '175.0', '153.0', '180.0', '110.0',
       '72.00', '86.00', '70.00', '76.00', '65.00', '69.00', '60.00',
       '80.00', '54.00', '208.0', '155.0', '112.0', '92.00', '145.0',
       '137.0', '158.0', '167.0', '94.00', '107.0', '230.0', '49.00',
       '75.00', '91.00', '122.0', '67.00', '83.00', '78.00', '52.00',
       '61.00', '93.00', '148.0', '129.0', '96.00', '71.00', '98.00',
       '115.0', '53.00', '81.00', '79.00', '120.0', '152.0', '102.0',
       '108.0', '68.00', '58.00', '149.0', '89.00', '63.00', '48.00',
       '66.00', '139.0', '103.0', '125.0', '133.0', '138.0', '135.0',
       '142.0', '77.00', '62.00', '132.0', '84.00', '64.00', '74.00',
       '116.0', '82.00'], dtype=object)

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 392 entries, 0 to 397
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     392 non-null    int64
 2   displacement  392 non-null    float64
 3   horsepower    392 non-null    object
 4   weight        392 non-null    float64
 5   aceleration   392 non-null    float64
 6   model year    392 non-null    int64
 7   origin        392 non-null    int64
 8   name          392 non-null    object
 9   kpl           392 non-null    float64
dtypes: float64(5), int64(3), object(2)
memory usage: 33.7+ KB

In [22]:
df['horsepower'] = df['horsepower'].astype('float')        # astype의 경우에는 무조건 다른 곳에 저장
df['horsepower'].dtype

dtype('float64')

In [23]:
df.dtypes

mpg             float64
cylinders         int64
displacement    float64
horsepower      float64
weight          float64
aceleration     float64
model year        int64
origin            int64
name             object
kpl             float64
dtype: object

In [24]:
print(df['origin'].unique())
                                 # 여러개를 replace할 때는 딕셔너리 형태
df['origin'].replace({1 : 'USA', 2 : 'EU', 3 : 'JPN'}, inplace = True)
df['origin'].unique()                                  # 분류로 나눠진 것 = 카테고리(category)

[1 3 2]

array(['USA', 'JPN', 'EU'], dtype=object)

In [25]:
# 문자형을 범주형으로 변환

df['origin'] = df['origin'].astype('category')
print(df['origin'].dtype)

category

In [26]:
# 문) 'model year'의 데이터 타입과 데이터를 확인해보고 범주형으로 형 변환

df['model year'].dtype

dtype('int64')

In [28]:
df['model year'].unique()

array([70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82], dtype=int64)

In [32]:
df['model year'] = df['model year'].astype('category')

In [34]:
print(df['model year'].dtype)

category